.text
.globl _start

_start:
    # ----------------------------------------------------
    # 1. 初始环境与常量配置
    # ----------------------------------------------------
    lui s0, 0x70000          # s0 = VRAM_BASE (0x7000_0000)
    
    # 屏幕中心坐标计算: X = (320-64)/2 = 128, Y = (240-64)/2 = 88
    li  s1, 128              # s1 = 图片左上角起始坐标 X
    li  s2, 88               # s2 = 图片左上角起始坐标 Y
    
    li  s3, 0                # s3 = 图片数据源在内存中的首地址 (0x0000_0000)
    li  s5, 0                # s5 = 屏幕背景色 (黑色 0x00000000)

    # ----------------------------------------------------
    # 2. 全屏清屏 (画黑色背景，方便凸显居中显示的图片)
    # ----------------------------------------------------
    lui t0, 0x4B             # 320*240*4 = 307200 = 0x4B000 字节
    add t0, s0, t0           # t0 = 显存结束地址
    add a0, s0, zero         # a0 = 当前写显存地址
clear_screen:
    sw  s5, 0(a0)            # 写入纯黑
    addi a0, a0, 4
    blt a0, t0, clear_screen # 如果没到结束地址，继续清屏

    # ----------------------------------------------------
    # 3. 计算图片在 VRAM 中的起始写指针地址
    # ----------------------------------------------------
    # 核心算法：addr = VRAM_BASE + (Y * 320 + X) * 4
    # 用移位加法替代乘法: Y * 320 = Y * 256 + Y * 64 = (Y<<8) + (Y<<6)
    slli t4, s2, 8           # t4 = Y * 256
    slli t5, s2, 6           # t5 = Y * 64
    add  t1, t4, t5          # t1 = Y * 320
    add  t1, t1, s1          # t1 = Y * 320 + X
    slli t1, t1, 2           # t1 = (Y * 320 + X) * 4 (转为字节偏移)
    add  t1, s0, t1          # t1 = 最终在 VRAM 中渲染第一行第一个像素的绝对地址

    # ----------------------------------------------------
    # 4. 绘制图片核心循环 (双重循环：外层测行，内层测列)
    # ----------------------------------------------------
    li  t0, 64               # t0 = 外层行计数器 (高度 h = 64)

draw_y_loop:
    li  t2, 64               # t2 = 内层列计数器 (宽度 w = 64)
    add t3, zero, t1         # t3 = 当前行 VRAM 中的扫描指针 (拷贝自本行起点 t1)

draw_x_loop:
    # --- 从内存读取像素并写入 VRAM ---
    lw  a2, 0(s3)            # 从 0x00000000 数据段加载 1 个像素 (格式: 0x0000????)
    sw  a2, 0(t3)            # 将该像素写入 VRAM
    
    # --- 指针推进与内层循环控制 ---
    addi s3, s3, 4           # 图片内存指针移动到下一个像素 (+4字节)
    addi t3, t3, 4           # 显存行扫描指针移动到下一个像素 (+4字节)
    
    addi t2, t2, -1          # w--
    bne  t2, zero, draw_x_loop # 这 64 个像素 (一行) 画完了吗？
    
    # --- 一行绘制完毕，调整到下一行的起点 ---
    # 下一行起点 = 当前起点 + 320个像素 * 4字节 = t1 + 1280
    addi t1, t1, 1280        # 更新行首显存指针到下一行
    
    # --- 外层循环控制 ---
    addi t0, t0, -1          # h--
    bne  t0, zero, draw_y_loop # 这 64 行全部画完了吗？

    # ----------------------------------------------------
    # 5. 渲染完成，挂起程序
    # ----------------------------------------------------
end:
    j end                    # 死循环停留，保留画面显示